Revit 2024 API
ParameterFilterRuleFactory Class
 Contains functions that create appropriate FilterRule objects based on the parameters given.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class ParameterFilterRuleFactory : IDisposable
Visual Basic
Public Class ParameterFilterRuleFactory _
	Implements IDisposable
Visual C++
public ref class ParameterFilterRuleFactory : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ParameterFilterRuleFactory
See Also
ParameterFilterRuleFactory Members
Autodesk.Revit.DB Namespace